# **Weather Analysis**

In [22]:
import pandas as pd

In [23]:
df = pd.read_csv('Tempreture_1901_2016_Pakistan.csv')
df.head()

   Temperature - (Celsius)  Year     Month
0                  7.72768  1901   January
1                  8.93600  1901  February
2                 16.96320  1901     March
3                 21.27410  1901     April
4                 26.04970  1901       May

### Highest Temprature

In [24]:
m = df['Temperature - (Celsius)'].max()
print('The highest temrature is ',m)

The highest temrature is  30.3058

### Lowest Temprature

In [25]:
l = df['Temperature - (Celsius)'].min()
print('The lowest temprature is ',l)

The lowest temprature is  5.91348

### Average Tempratue in each year

In [30]:
pd.DataFrame(df.groupby('Year')['Temperature - (Celsius)'].mean()).tail()

      Temperature - (Celsius)
Year
2012                20.053536
2013                20.652717
2014                20.527868
2015                20.559059
2016                21.414617

### Hottest year

In [36]:
pd.DataFrame(df.groupby('Year')['Temperature - (Celsius)'].mean().sort_values(ascending=False)).head()

      Temperature - (Celsius)
Year
2016                21.414617
2004                21.051189
2010                20.999923
2006                20.994692
1941                20.984646

### Coolest Year

In [37]:
pd.DataFrame(df.groupby('Year')['Temperature - (Celsius)'].mean().sort_values(ascending=True)).head()

      Temperature - (Celsius)
Year
1950                18.907104
1957                19.123396
1935                19.293058
1972                19.345729
1917                19.383954

### Average temprature in each month

In [42]:
pd.DataFrame(df.groupby('Month')['Temperature - (Celsius)'].mean().sort_values(ascending=False))

           Temperature - (Celsius)
Month
June                     29.043975
July                     28.853678
August                   27.667918
May                      26.163297
September                25.280974
April                    21.540728
October                  20.905837
March                    15.985621
November                 15.160412
February                 10.643501
December                 10.300508
January                   8.539104